## [ 웹 교재 내용 따라적기 ]

### 비디오 게임 <hr>

In [144]:
## 모듈
import pandas as pd
import matplotlib.pyplot as plt
import koreanize_matplotlib

In [145]:
## 파일 읽어오기 -> O
vgDF = pd.read_csv('./DATA/vgsales.csv',index_col='Rank')
vgDF.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [146]:
## 원본 프레임을 'Global_Sales' 컬럼을 기준으로 내림차순 정렬하세요.
vgDF2 = vgDF.copy()

# ## 이건 틀림 -> 왜냐하면 series로 만들고 정렬하는거니깐 데이터프레임이 아님
# vgDF2['Global_Sales'].sort_values()

## 이게 정답 !
vgDF2 = vgDF2.sort_values(by='Global_Sales', ascending=False)
vgDF2.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [147]:
## 원본 데이터프레임을 'Platform'과 'Global_Sales'를 기준으로 정렬하세요.  -> O
# 'Platform'은 오름차순으로 정렬하고 'Global_Sales'는 내림차순으로 정렬하세요.
vgDF3 = vgDF.copy()

vgDF3.sort_values(by=['Platform','Global_Sales'], ascending=[True, False])

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
90,Pac-Man,2600,1982.0,Puzzle,Atari,7.28,0.45,0.0,0.08,7.81
240,Pitfall!,2600,1981.0,Platform,Activision,4.21,0.24,0.0,0.05,4.50
259,Asteroids,2600,1980.0,Shooter,Atari,4.00,0.26,0.0,0.05,4.31
545,Missile Command,2600,1980.0,Shooter,Atari,2.56,0.17,0.0,0.03,2.76
608,Space Invaders,2600,NaN,Shooter,Atari,2.36,0.14,0.0,0.03,2.53
...,...,...,...,...,...,...,...,...,...,...
16533,Sébastien Loeb Rally Evo,XOne,2016.0,Racing,Milestone S.r.l,0.00,0.01,0.0,0.00,0.01
16534,Hitman (2016),XOne,2016.0,Action,Square Enix,0.00,0.01,0.0,0.00,0.01
16565,Mighty No. 9,XOne,2016.0,Platform,Deep Silver,0.01,0.00,0.0,0.00,0.01
16572,Resident Evil 4 HD,XOne,2016.0,Shooter,Capcom,0.01,0.00,0.0,0.00,0.01
16579,Rugby Challenge 3,XOne,2016.0,Sports,Alternative Software,0.00,0.01,0.0,0.00,0.01

In [148]:
## 원본 데이터 프레임에서 Year 컬럼의 값이 NaN인 로우를 제거하고 이를 원본에 반영하세요. -> X
vgDF4 = vgDF.copy()

# ## 계속 시리즈로 뽑아내서 하는데, 데이터 프레임에 해야됨. 정신차려
# vgDF4.Year.dropna(inplace=True)

## 정답
vgDF4.dropna(subset='Year', inplace=True)
display(vgDF4)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...
16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [149]:
## 데이터프레임에서 'Year' 컬럼의 타입을 int로 변경하세요. -> O
vgDF4.Year = vgDF4.Year.astype('int')
display(vgDF4)
vgDF4.info()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
1,Wii Sports,Wii,2006,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
3,Mario Kart Wii,Wii,2008,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
4,Wii Sports Resort,Wii,2009,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
5,Pokemon Red/Pokemon Blue,GB,1996,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...
16596,Woody Woodpecker in Crazy Castle 5,GBA,2002,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16597,Men in Black II: Alien Escape,GC,2003,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16598,SCORE International Baja 1000: The Official Game,PS2,2008,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16599,Know How 2,DS,2010,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16600,Spirits & Spells,GBA,2003,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

<class 'pandas.core.frame.DataFrame'>
Index: 16327 entries, 1 to 16600
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          16327 non-null  object
 1   Platform      16327 non-null  object
 2   Year          16327 non-null  int64
 3   Genre         16327 non-null  object
 4   Publisher     16291 non-null  object
 5   NA_Sales      16327 non-null  float64
 6   EU_Sales      16327 non-null  float64
 7   JP_Sales      16327 non-null  float64
 8   Other_Sales   16327 non-null  float64
 9   Global_Sales  16327 non-null  float64
dtypes: float64(5), int64(1), object(4)
memory usage: 1.4+ MB

In [150]:
## 데이터프레임에서 Genre 컬럼의 각 장르별 개수를 출력하세요. -> X
# print(vgDF4.Genre.nunique())  -> 이거 아님

## 정답
vgDF4.Genre.value_counts()

Genre
Action          3253
Sports          2304
Misc            1710
Role-Playing    1471
Shooter         1282
Adventure       1276
Racing          1226
Platform         876
Simulation       851
Fighting         836
Strategy         671
Puzzle           571
Name: count, dtype: int64

In [151]:
## 데이터프레임에서 value_counts 메서드를 사용해서 Genre 컬럼의 각 장르별 백분율을 계산하세요.
vgDF4.Genre.value_counts(normalize=True) * 100

Genre
Action          19.924052
Sports          14.111594
Misc            10.473449
Role-Playing     9.009616
Shooter          7.852024
Adventure        7.815275
Racing           7.509034
Platform         5.365346
Simulation       5.212225
Fighting         5.120353
Strategy         4.109757
Puzzle           3.497274
Name: proportion, dtype: float64

In [152]:
## 데이터프레임에서 게임 이름(Name)에 'Super Mario'가 포함된 게임들만 선택하세요.
mario = vgDF4.Name.str.contains('Super Mario') 
vgDF4 = vgDF4[mario]
vgDF4.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
7,New Super Mario Bros.,DS,2006,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01
9,New Super Mario Bros. Wii,Wii,2009,Platform,Nintendo,14.59,7.06,4.70,2.26,28.62
19,Super Mario World,SNES,1990,Platform,Nintendo,12.78,3.75,3.54,0.55,20.61
22,Super Mario Land,GB,1989,Platform,Nintendo,10.83,2.71,4.18,0.42,18.14

In [153]:
## 데이터프레임의 groupby 메서드를 사용하여 플랫폼과 장르별 Global_Sales의 합을 계산하세요.
vgDF4[['Platform','Genre','Global_Sales']].groupby(by=['Platform','Genre']).sum(numeric_only=True)

                       Global_Sales
Platform Genre
3DS      Platform             20.61
         Puzzle                0.46
DS       Platform             40.43
GB       Adventure            11.18
         Platform             28.40
GBA      Platform             20.91
GC       Platform              6.31
         Sports                1.61
N64      Platform             11.89
NES      Platform             67.63
SNES     Platform             35.28
         Racing                8.76
         Role-Playing          2.14
Wii      Platform             50.43
WiiU     Platform             12.62

In [154]:
## 판다스 melt 함수를 사용하여 다음과 같은 데이터프레임을 생성하세요.
pd.melt(
    vgDF, 
    id_vars=['Name', 'Platform', 'Genre'],                              ## id_vars      : 그대로 들고 가는 것
    value_vars=['NA_Sales', 'EU_Sales', 'JP_Sales', 'Other_Sales'],     ## value_vars   : 세로로 길게 펼칠 컬럼들
    var_name='Region',                                                  ## var_name     : 열을 세로로하면 해당 열을 어떻게 부를지 
    value_name='Sales'                                                  ## value_name   : 해당 셀에 들어있었던 수치값 이름
)

,Name,Platform,Genre,Region,Sales
0,Wii Sports,Wii,Sports,NA_Sales,41.49
1,Super Mario Bros.,NES,Platform,NA_Sales,29.08
2,Mario Kart Wii,Wii,Racing,NA_Sales,15.85
3,Wii Sports Resort,Wii,Sports,NA_Sales,15.75
4,Pokemon Red/Pokemon Blue,GB,Role-Playing,NA_Sales,11.27
...,...,...,...,...,...
66387,Woody Woodpecker in Crazy Castle 5,GBA,Platform,Other_Sales,0.00
66388,Men in Black II: Alien Escape,GC,Shooter,Other_Sales,0.00
66389,SCORE International Baja 1000: The Official Game,PS2,Racing,Other_Sales,0.00
66390,Know How 2,DS,Puzzle,Other_Sales,0.00
66391,Spirits & Spells,GBA,Platform,Other_Sales,0.00

### 부동산 <hr>

In [155]:
df_m = pd.read_excel('./DATA/매매_41133_202101.xlsx', index_col=0)
df_m.head()

,거래금액,거래유형,건축년도,년,법정동,아파트,월,일,전용면적,중개사소재지,지번,지역코드,층,해제사유발생일,해제여부
0,"68,000",NaN,2006,2021,성남동,금호어울림,1,2,59.93,NaN,3126,41133,9,NaN,NaN
1,"29,500",NaN,2004,2021,성남동,SR하이원,1,2,45.31,NaN,3755,41133,5,NaN,NaN
2,"49,000",NaN,2006,2021,성남동,동부브리앙뜨,1,3,80.49,NaN,2163,41133,3,NaN,NaN
3,"40,800",NaN,1992,2021,성남동,현대,1,7,42.62,NaN,3121,41133,10,NaN,NaN
4,"53,000",NaN,2004,2021,성남동,띠아모,1,7,116.56,NaN,3753,41133,9,NaN,NaN

In [156]:
## 거래금액 컬럼에는 문자열(object) 타입으로 데이터가 저장돼 있습니다. -> O
# 콤마를 제거하고 데이터 타입을 숫자로 변경하세요.
df_m.거래금액 = df_m.거래금액.str.replace(',','').astype('int')
df_m.info()
df_m.head()

<class 'pandas.core.frame.DataFrame'>
Index: 124 entries, 0 to 123
Data columns (total 15 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   거래금액     124 non-null    int64
 1   거래유형     0 non-null      float64
 2   건축년도     124 non-null    int64
 3   년        124 non-null    int64
 4   법정동      124 non-null    object
 5   아파트      124 non-null    object
 6   월        124 non-null    int64
 7   일        124 non-null    int64
 8   전용면적     124 non-null    float64
 9   중개사소재지   0 non-null      float64
 10  지번       124 non-null    object
 11  지역코드     124 non-null    int64
 12  층        124 non-null    int64
 13  해제사유발생일  3 non-null      object
 14  해제여부     3 non-null      object
dtypes: float64(3), int64(7), object(5)
memory usage: 15.5+ KB

,거래금액,거래유형,건축년도,년,법정동,아파트,월,일,전용면적,중개사소재지,지번,지역코드,층,해제사유발생일,해제여부
0,68000,NaN,2006,2021,성남동,금호어울림,1,2,59.93,NaN,3126,41133,9,NaN,NaN
1,29500,NaN,2004,2021,성남동,SR하이원,1,2,45.31,NaN,3755,41133,5,NaN,NaN
2,49000,NaN,2006,2021,성남동,동부브리앙뜨,1,3,80.49,NaN,2163,41133,3,NaN,NaN
3,40800,NaN,1992,2021,성남동,현대,1,7,42.62,NaN,3121,41133,10,NaN,NaN
4,53000,NaN,2004,2021,성남동,띠아모,1,7,116.56,NaN,3753,41133,9,NaN,NaN

In [157]:
## 다양한 크기의 아파트 가격을 비교하기위해 매매평단가를 계산합니다. 
#  일반적으로 평단가는 거래금액과 공급면적으로 계산하지만, 
#  이번문제에서는 주어진 데이터 거래금액과 전용면적으로 매매평단가를 계산해 봅시다.
#  m^2 를 평으로 환산할 때는 3.3으로 값을 나눕니다.
df_m['매매평단가'] = df_m['거래금액'] / (df_m['전용면적'] / 3.3) 
df_m.head()

,거래금액,거래유형,건축년도,년,법정동,아파트,월,일,전용면적,중개사소재지,지번,지역코드,층,해제사유발생일,해제여부,매매평단가
0,68000,NaN,2006,2021,성남동,금호어울림,1,2,59.93,NaN,3126,41133,9,NaN,NaN,3744.368430
1,29500,NaN,2004,2021,성남동,SR하이원,1,2,45.31,NaN,3755,41133,5,NaN,NaN,2148.532333
2,49000,NaN,2006,2021,성남동,동부브리앙뜨,1,3,80.49,NaN,2163,41133,3,NaN,NaN,2008.945211
3,40800,NaN,1992,2021,성남동,현대,1,7,42.62,NaN,3121,41133,10,NaN,NaN,3159.080244
4,53000,NaN,2004,2021,성남동,띠아모,1,7,116.56,NaN,3753,41133,9,NaN,NaN,1500.514756

In [158]:
## 주어진 성남시 데이터에는 총 8개의 법정동이 존재합니다. 동별로 매매평단가의 평균을 계산하세요.
df1 = df_m[['법정동','매매평단가']].groupby(by=['법정동'], observed=True).mean(numeric_only=True)
df1

            매매평단가
법정동
금광동   3240.974040
도촌동   3231.935513
상대원동  2789.911981
성남동   2387.478986
여수동   4445.978156
은행동   3268.274510
중앙동   4094.691326
하대원동  2592.894990

In [159]:
# 하대원동의 아파트별 매매평단가를 출력하세요.
# dfk = df_m[df_m['법정동'] == '하대원동']
# d = dfk.set_index(['아파트','매매평단가'])
# d = d.sort_index()
# # d = d['아파트'].index_counts()
# display(d)


##################################################
dfk = df_m[df_m['법정동'] == '하대원동']
dfk = dfk.sort_values('아파트')
dfk = dfk.loc[:, ['아파트', '매매평단가']]
display(dfk)
# a = dfk.아파트.value_counts()

# apt_col = dfk.아파트.unique()

# for aptName in apt_col:
#     # a = (dfk['아파트'] == aptName).sum()
#     print((dfk['아파트'] == aptName).sum())
#     dfk['매매건수'] = (dfk['아파트'] == aptName).sum()

# dfk

        아파트        매매평단가
95       삼남  1814.562002
110      삼남  2031.889290
108      삼남  2030.401737
101      삼남  1992.753623
102      삼남  2051.744886
107      삼남  2059.178744
104      삼남  2209.554832
112    성남자이  3812.135356
98     성남자이  3564.594099
99     성남자이  2834.451112
105    성남자이  2373.814499
106    성남자이  2373.814499
100    성원초원  2206.619860
94      아튼빌  3007.417874
97      아튼빌  3117.896223
96      아튼빌  3021.181454
111     아튼빌  3470.205308
103     아튼빌  3106.247794
109  태연스카이빌  2186.541613

In [160]:
# 하대원동의 아파트별 매매평단가와 매매건수를 출력하세요.
df_m['매매건수'] = 1

dfk = df_m[df_m['법정동'] == '하대원동']
dfk[['매매평단가','아파트','매매건수']].groupby(by=['아파트'], observed=True).agg({'매매평단가':'mean', '매매건수':'count'})

              매매평단가  매매건수
아파트
삼남      2027.155016     7
성남자이    2991.761913     5
성원초원    2206.619860     1
아튼빌     3144.589731     5
태연스카이빌  2186.541613     1

In [161]:
df_m.월 = df_m.월.astype('str')
df_m.일 = df_m.일.astype('str')
df_m.년 = df_m.년.astype('str')

def f(x):
    if len(x) == 1:
        return f"0{x}"
    else:
        return x

df_m['월'] = df_m['월'].map(f)
df_m['일'] = df_m['일'].map(f)

df_m['날짜'] = df_m['년'] + df_m['월'] + df_m['일'] 
df_m['날짜'] = pd.to_datetime(df_m['날짜'])

temp = df_m[ ["날짜", "법정동", "아파트", "매매평단가"] ]
temp.head(2)

          날짜  법정동    아파트        매매평단가
0 2021-01-02  성남동  금호어울림  3744.368430
1 2021-01-02  성남동  SR하이원  2148.532333

### 시리즈 생성 <hr>

In [162]:
## 시리즈 생성
sr1 = pd.Series([100,200,300],name='점수')
sr1

0    100
1    200
2    300
Name: 점수, dtype: int64

In [163]:
## 시리즈 추가 -> O
sr2 = pd.Series(index=['철수','영희','아름'],data=[100,200,300])
sr2

철수    100
영희    200
아름    300
dtype: int64

In [164]:
## 시리즈의 생성 (딕셔너리) -> X
sr3 = pd.Series({
    '철수':100,
    '영희':200,
    '아름':300
    })
sr3

철수    100
영희    200
아름    300
dtype: int64

In [165]:
## 시리즈 생성 -> X
index = ['삼성전자','셀트리온','카카오','삼성전자우','현대바이오']
data = [73000,356000,367000,68600,34150]
sr4 = pd.Series(data=data, index=index)
sr4

삼성전자      73000
셀트리온     356000
카카오      367000
삼성전자우     68600
현대바이오     34150
dtype: int64

In [166]:
## 인덱스 없이 시리즈에 저장된 데이터만을 출력해보세요.
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = pd.Series(data, index)
s.index

Index(['철수', '영희', '아름'], dtype='object')

In [167]:
## 시리즈를 딕셔너리로 변경해 보세요.
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = pd.Series(data, index)
s = s.to_dict()
s

{'철수': 100, '영희': 200, '아름': 300}

In [168]:
## 시리즈를 엑셀 파일(data.xlsx)에 저장해 보세요.
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = pd.Series(data, index)
s.to_excel('./data.xlsx')

In [169]:
## 엑셀 파일(data.xlsx)을 읽어 오세요. -> X
# 데이터를 불러오면 DF인데, 해당 컬럼을 인덱싱하면 series를 얻을 수 있음. 
pd.read_excel('./data.xlsx',index_col=0)[0]

철수    100
영희    200
아름    300
Name: 0, dtype: int64

## 시리즈 데이터 타입 <hr>

In [170]:
## 시리즈의 데이터 타입을 출력해보세요. -> X
# dtype는 ()강 없음. 메소드가 아니라 ''임
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = pd.Series(data, index)

s.dtype

dtype('int64')

In [171]:
## 다음 시리즈의 데이터 타입은 무엇일까요? -> O
data = [  10,  "가" ]
s = pd.Series( data )
s.dtype
# 정답 : object

dtype('O')

In [172]:
## 시리즈에서 인덱스의 데이터 타입을 출력해보세요. -> O
s.index.dtype

dtype('int64')

In [173]:
## 시리즈 객체로 생성한 후 시리즈의 name 속성에 '종가'를 
# 인덱스의 name 속성에 날짜를 설정해보세요.
index = ['2020-12-11','2020-12-10','2020-12-09','2020-12-08','2020-12-07']
data = [73400,72900,73900,71700,72900]
s=pd.Series(index=index, data=data)
s.name='종가'
s.index.name='날짜'
s

날짜
2020-12-11    73400
2020-12-10    72900
2020-12-09    73900
2020-12-08    71700
2020-12-07    72900
Name: 종가, dtype: int64

In [174]:
## 인덱스 이름을 icecream으로 변경 -> O
data = {"apple": 1500, "banana": 3000}
s = pd.Series(data)
s.index.name='icecream'
s

icecream
apple     1500
banana    3000
dtype: int64

In [175]:
## 다음 시리즈 객체의 이름을 'number'로 지정하세요.
s = pd.Series(data=[1, 2, 3])
s.name = 'number'

In [176]:
## 다음 시리즈 객체를 생성하세요.
import numpy as np
pd.Series([1.0,2.0,np.nan])

0    1.0
1    2.0
2    NaN
dtype: float64

In [ ]:
import pandas as pd

s = pd.Series([1, 2, 3])
s.array

<NumpyExtensionArray>
[1, 2, 3]
Length: 3, dtype: int64

In [12]:
import pandas as pd

s = pd.Series([1, 2, 3])
s.to_numpy()

array([1, 2, 3])

### 시리즈 인덱싱과 슬라이싱 <hr>

In [177]:
data = [100, 200, 300, 400, 500, 600]
index = ["08/01", "08/02", "08/03", "08/04", "08/05", "08/06"]
s = pd.Series(data, index)
s.head(3).index

Index(['08/01', '08/02', '08/03'], dtype='object')

In [178]:
data = [100, 200, 300, 400, 500, 600] 
index = ["08/01", "08/02", "08/03", "08/04", "08/05", "08/06"] 
s = pd.Series(data, index)
s[::2]

08/01    100
08/03    300
08/05    500
dtype: int64

In [179]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = pd.Series(data, index)
s.loc['순이'] = 400
s

철수    100
영희    200
아름    300
순이    400
dtype: int64

In [180]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = pd.Series(data, index)
s.drop('철수')

영희    200
아름    300
dtype: int64

In [181]:
data = {
    "삼성전자": "전기,전자",
    "LG전자": "전기,전자",
    "현대차": "운수장비",
    "NAVER": "서비스업",
    "카카오": "서비스업"
}
s = pd.Series(data)
s.unique()

array(['전기,전자', '운수장비', '서비스업'], dtype=object)

In [182]:
s = pd.Series(
    data = [9000, 9000, 8000, 9000, 10000],
    index = ['김과장', '이대리', '박전무', '이대리', '이대리']
)
s.index.value_counts()

이대리    3
김과장    1
박전무    1
Name: count, dtype: int64

In [183]:
data = [100, 300, 200]
index = ["08/01", "08/02", "08/03"]
s = pd.Series(data, index)
s.sort_values(inplace=True)
s

08/01    100
08/03    200
08/02    300
dtype: int64

In [184]:
data = [100, 300, 200]
s = pd.Series(data)
s = s ** 4
s

0     100000000
1    8100000000
2    1600000000
dtype: int64

In [185]:
s = pd.Series(data=[51500, 51200, 52500], index=["5/1", "5/2", "5/3"])
s = s[s < 52000]
s

5/1    51500
5/2    51200
dtype: int64

In [186]:
s = pd.Series(data=[51500, 51200, 52500], index=["5/1", "5/2", "5/3"])
s.iloc[1:3]

5/2    51200
5/3    52500
dtype: int64

In [187]:
import numpy as np
from pandas import Series 

data = [1, 2, 3, 4, np.nan]
s = Series(data=data)
s.notna().sum()
s.count()
s.value_counts()

1.0    1
2.0    1
3.0    1
4.0    1
Name: count, dtype: int64

In [188]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s.replace(100,200)

철수    200
영희    200
아름    300
dtype: int64

In [189]:
data = ["100,000", "200,000", "300,000"]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s.str.replace(',','').astype("int32")

철수    100000
영희    200000
아름    300000
dtype: int32

In [190]:
s = pd.Series([1, 2, 3, 4], index=["d", "c", "a", "b"])
s.reindex(['a', 'b', 'c', 'd'])

a    3
b    4
c    2
d    1
dtype: int64

In [191]:
s = pd.Series([1, 2, 3], index=['2023-01-01', '2023-01-02', '2023-01-03'])
s.index = s.index.str[5:]
s

01-01    1
01-02    2
01-03    3
dtype: int64

In [192]:
s = pd.Series([1, 2, 3, np.nan])
s.dropna(inplace=True)
s

0    1.0
1    2.0
2    3.0
dtype: float64

In [193]:
s = pd.Series(["1,234", "5,678", "9,876"])
s.map(lambda x:x.replace(',',''))

0    1234
1    5678
2    9876
dtype: object

In [194]:
s = pd.Series([10, 100, 1000])
s.apply(np.log10)

0    1.0
1    2.0
2    3.0
dtype: float64

In [195]:
import pandas as pd

index = ['김은수','박정민','이하나']
col = ['나이','직책']
data = [[35,'과장'], [30,'대리'],[28,'대리']]

df = pd.DataFrame(data=data, index=index, columns=col)
df

     나이  직책
김은수  35  과장
박정민  30  대리
이하나  28  대리

In [196]:
df = pd.DataFrame({'이름':['김은수','박정민','이하나'],
                   '나이' : [35,30,28],
                   '직책' : ['과장','대리','대리']})
df

    이름  나이  직책
0  김은수  35  과장
1  박정민  30  대리
2  이하나  28  대리

In [197]:
data = [['김은수',35,'과장'],['박정민',30,'대리'],['이하나',28,'대리']]
df = pd.DataFrame(data,columns=['이름','나이','직책'])
df

    이름  나이  직책
0  김은수  35  과장
1  박정민  30  대리
2  이하나  28  대리

In [198]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df = df.set_index('종목코드')
df.index.name = '종목코드'
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [199]:
index = ["037730", "036360", "005760"]
data = [["3R", "1510"],
         ["3SOFT", 1790],
         ["ACTS", 1185]]
columns = ["종목명", "현재가"]
df = pd.DataFrame(data=data, index=index, columns=columns)
df.reset_index()

    index    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [200]:
df.index

Index(['037730', '036360', '005760'], dtype='object')

In [201]:
df.columns

Index(['종목명', '현재가'], dtype='object')

In [202]:
############# 다시 보기
# df['현재가']        # '현재가' 컬럼 1개 선택 (Series)
# df[['현재가']]      # '현재가' 컬럼 1개지만 DataFrame으로 선택
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)
df
df[['현재가']]
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [203]:
s = df[['현재가','등락률']]
s

         현재가   등락률
종목코드
037730  1510  7.36
036360  1790  1.65
005760  1185  1.28

In [204]:
df.iloc[0]
df.iloc[-1]
df.iloc[[0,2]]

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005760  ACTS  1185  1.28

In [205]:
df.loc['037730']
df.loc[['037730','005760']]

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005760  ACTS  1185  1.28

In [206]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)
df = df[df['현재가'] > 1500]
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [207]:
df.loc['066570'] =['LG전자',60000,3.84]
df

          종목명    현재가   등락률
종목코드
037730     3R   1510  7.36
036360  3SOFT   1790  1.65
066570   LG전자  60000  3.84

In [208]:
df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])
df.columns = ['a','b','c']
df

   a  b  c
0  1  2  3
1  4  5  6

In [209]:
df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])
df.rename(columns={'A':'a', 'B':'b', 'C':'c'})

   a  b  c
0  1  2  3
1  4  5  6

In [210]:
import pandas as pd
import numpy as np

data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
display(df)
df.index.name='year'
df.columns.name='company'
df

        카카오  NAVER
2019    NaN     52
2020  221.0     47
2021   35.0      3

company    카카오  NAVER
year
2019       NaN     52
2020     221.0     47
2021      35.0      3

In [211]:
import pandas as pd
import numpy as np

data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
df.set_index(['NAVER','카카오'])

Empty DataFrame
Columns: []
Index: [(52, nan), (47, 221.0), (3, 35.0)]

In [212]:
import pandas as pd
import numpy as np

data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
display(df)
df.drop('NAVER',axis='columns',inplace=True)
df

        카카오  NAVER
2019    NaN     52
2020  221.0     47
2021   35.0      3

        카카오
2019    NaN
2020  221.0
2021   35.0

In [213]:
data = [
    {"cd":"A060310", "nm":"3S", "open":2920, "close":2800},
    {"cd":"A095570", "nm":"AJ네트웍스", "open":1920, "close":1900},
    {"cd":"A006840", "nm":"AK홀딩스", "open":2020, "close":2010},
    {"cd":"A054620", "nm":"APS홀딩스", "open":3120, "close":3200}
]
df = pd.DataFrame(data=data)
df = df.set_index('cd')

df.query('close > open')

             nm  open  close
cd
A054620  APS홀딩스  3120   3200

In [214]:
df.query('close >= 3000')

             nm  open  close
cd
A054620  APS홀딩스  3120   3200

In [215]:
df.query('(open >= 2000) & (close >= open)')

             nm  open  close
cd
A054620  APS홀딩스  3120   3200

In [216]:
df[df.nm.str.startswith('A')]
# df.query("nm.str.startswith('A')")

             nm  open  close
cd
A095570  AJ네트웍스  1920   1900
A006840   AK홀딩스  2020   2010
A054620  APS홀딩스  3120   3200

In [217]:
df.nm.str.contains('홀딩스')

cd
A060310    False
A095570    False
A006840     True
A054620     True
Name: nm, dtype: bool

In [218]:
data = {
    "PER": [6.42, 17.63, 21.09, 13.93],
    "PBR": [1.10, 1.49, 2.06, 1.88],
    "DPS": [1416, 1716, 2994, 1755]
}
index = ["2019/12", "2020/12", "2021/12", "2022/12(E)"]
df = pd.DataFrame(data=data, index=index)
# df.filter(items=["PER", "PBR"])
df[['PER','PBR']]

              PER   PBR
2019/12      6.42  1.10
2020/12     17.63  1.49
2021/12     21.09  2.06
2022/12(E)  13.93  1.88

In [219]:
from datetime import *

columns = ['open', 'high', 'low', 'close']
index1 = [
    datetime(2022, 9, 8),
    datetime(2022, 9, 7),
    datetime(2022, 9, 6),
    datetime(2022, 9, 5),
    datetime(2022, 9, 2)
]

index2 = [
    datetime(2022, 9, 1),
    datetime(2022, 8, 31),
    datetime(2022, 8, 30),
    datetime(2022, 8, 29),
    datetime(2022, 8, 26)
]

df1 = pd.DataFrame(data=np.arange(0, 20).reshape(5,4), index=index1, columns=columns)
df2 = pd.DataFrame(data=np.arange(20,40).reshape(5,4), index=index2, columns=columns)

display(df1, df2)
pd.concat([df1,df2], axis=0)

            open  high  low  close
2022-09-08     0     1    2      3
2022-09-07     4     5    6      7
2022-09-06     8     9   10     11
2022-09-05    12    13   14     15
2022-09-02    16    17   18     19

            open  high  low  close
2022-09-01    20    21   22     23
2022-08-31    24    25   26     27
2022-08-30    28    29   30     31
2022-08-29    32    33   34     35
2022-08-26    36    37   38     39

            open  high  low  close
2022-09-08     0     1    2      3
2022-09-07     4     5    6      7
2022-09-06     8     9   10     11
2022-09-05    12    13   14     15
2022-09-02    16    17   18     19
2022-09-01    20    21   22     23
2022-08-31    24    25   26     27
2022-08-30    28    29   30     31
2022-08-29    32    33   34     35
2022-08-26    36    37   38     39

In [220]:
pd.concat([df1,df2], axis=1)

            open  high   low  close  open  high   low  close
2022-08-26   NaN   NaN   NaN    NaN  36.0  37.0  38.0   39.0
2022-08-29   NaN   NaN   NaN    NaN  32.0  33.0  34.0   35.0
2022-08-30   NaN   NaN   NaN    NaN  28.0  29.0  30.0   31.0
2022-08-31   NaN   NaN   NaN    NaN  24.0  25.0  26.0   27.0
2022-09-01   NaN   NaN   NaN    NaN  20.0  21.0  22.0   23.0
2022-09-02  16.0  17.0  18.0   19.0   NaN   NaN   NaN    NaN
2022-09-05  12.0  13.0  14.0   15.0   NaN   NaN   NaN    NaN
2022-09-06   8.0   9.0  10.0   11.0   NaN   NaN   NaN    NaN
2022-09-07   4.0   5.0   6.0    7.0   NaN   NaN   NaN    NaN
2022-09-08   0.0   1.0   2.0    3.0   NaN   NaN   NaN    NaN

In [221]:
index1 = [
    datetime(2022, 9, 8),
    datetime(2022, 9, 7)
]

index2 = [
    datetime(2022, 9, 6),
    datetime(2022, 9, 5)
]
df1 = pd.DataFrame(np.arange(0, 6).reshape(2,3), index=index1, columns=['open', 'high', 'low'])
df2 = pd.DataFrame(np.arange(6,12).reshape(2,3), index=index2, columns=['high', 'low', 'close'])

display(df1,df2)
pd.concat([df1,df2], join='inner')

            open  high  low
2022-09-08     0     1    2
2022-09-07     3     4    5

            high  low  close
2022-09-06     6    7      8
2022-09-05     9   10     11

            high  low
2022-09-08     1    2
2022-09-07     4    5
2022-09-06     6    7
2022-09-05     9   10

In [222]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1,s2],axis=1)

   0  1
0  a  c
1  b  d

In [223]:
index = ["2020", "2021"]

data1 = {
    "PER": [21.09, 13.55],
    "PBR": [2.06, 1.80]
}

data2 = {
    "PER": [12.40, 24.19],
    "PBR": [1.58, 1.44]
}

df1 = pd.DataFrame(data=data1, index=index)
df2 = pd.DataFrame(data=data2, index=index)

display(df1,df2)
pd.concat([df1,df2], keys=['삼성전자','LG전자'],names=["종목명", "연도"])

        PER   PBR
2020  21.09  2.06
2021  13.55  1.80

        PER   PBR
2020  12.40  1.58
2021  24.19  1.44

             PER   PBR
종목명  연도
삼성전자 2020  21.09  2.06
     2021  13.55  1.80
LG전자 2020  12.40  1.58
     2021  24.19  1.44

In [224]:
data = [
    ["2차전지(생산)", "SK이노베이션", 10.19, 1.29],
    ["해운", "팬오션", 21.23, 0.95],
    ["시스템반도체", "티엘아이", 35.97, 1.12],
    ["해운", "HMM", 21.52, 3.20],
    ["시스템반도체", "아이에이", 37.32, 3.55],
    ["2차전지(생산)", "LG화학", 83.06, 3.75]
]

columns = ["테마", "종목명", "PER", "PBR"]
df = pd.DataFrame(data=data, columns=columns)
display(df[['종목명','PER','PBR']].groupby(by=['종목명'],observed=True).size())
df.종목명.value_counts()

종목명
HMM        1
LG화학       1
SK이노베이션    1
아이에이       1
티엘아이       1
팬오션        1
dtype: int64

종목명
SK이노베이션    1
팬오션        1
티엘아이       1
HMM        1
아이에이       1
LG화학       1
Name: count, dtype: int64

In [225]:
gb = df.groupby(by='테마')
gb.get_group('2차전지(생산)')

         테마      종목명    PER   PBR
0  2차전지(생산)  SK이노베이션  10.19  1.29
5  2차전지(생산)     LG화학  83.06  3.75

In [226]:
df.groupby(by='테마')[["PER"]].mean()

             PER
테마
2차전지(생산)  46.625
시스템반도체    36.645
해운        21.375

In [230]:
df[["PER","PBR","테마"]].groupby(by='테마').mean()

             PER    PBR
테마
2차전지(생산)  46.625  2.520
시스템반도체    36.645  2.335
해운        21.375  2.075

In [232]:
df.groupby("테마").agg(max)

C:\Users\qjadl\AppData\Local\Temp\ipykernel_17064\1887360635.py:1: FutureWarning: The provided callable <built-in function max> is currently using DataFrameGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby("테마").agg(max)

              종목명    PER   PBR
테마
2차전지(생산)  SK이노베이션  83.06  3.75
시스템반도체       티엘아이  37.32  3.55
해운            팬오션  21.52  3.20

In [234]:

df.groupby("테마").agg({"PER": max, "PBR": min})

C:\Users\qjadl\AppData\Local\Temp\ipykernel_17064\993441145.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby("테마").agg({"PER": max, "PBR": min})
C:\Users\qjadl\AppData\Local\Temp\ipykernel_17064\993441145.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby("테마").agg({"PER": max, "PBR": min})

            PER   PBR
테마
2차전지(생산)  83.06  1.29
시스템반도체    37.32  1.12
해운        21.52  0.95

In [235]:
df.groupby(by='테마')['종목명'].nunique()

테마
2차전지(생산)    2
시스템반도체      2
해운          2
Name: 종목명, dtype: int64